--  09-2016
-- 1A - left join не е той, защото ще хване допълнителна информация
-- 1Б - ОК
-- 1В - ORDER by преди HAVING не е вярно
-- 1Г - Ще хване държави които нямат кораби.Заявката е все едно имаме left join.

-- 2A - OK
-- 2Б - HAVING върви с GROUP BY
-- 2В - COUNT(DISTINCT .) > COUNT(..) не е правилно сравнение, трябва и двата count-a да са с DISTINCT
-- 2Г - CROSS JOIN не се поддържа във всички субедета.

--  07-2016
-- 1А - ОК
-- 1Б - Няма как да вземем заглавието като връщаме cert
-- 1B - От WHERE клаузата получава информация само за 'Pretty Woman'
-- 1Г - NOT IN - Прави обратното на исканото

-- 2А - MAX(starname) - не е ОК трябва да се селектира с (SELECT .. FROM ...)
-- 2Б - В COUNT(...) - не може да има subquery.
-- 2В - 
-- COUNT(*) - брой по първичният ключ (хваща когато starname има NULL ст-ти)
-- COUNT(starname) - брой по колоната (НЕ хаваща когато starname има NULL ст-ти)
-- 2Г - OK